title: Suspicious LSASS Access via ProcessAccess
id: 0364c0b3-5f83-4735-8d83-9e815adba922
status: stable
description: Detects non-security processes accessing lsass.exe using Sysmon Event
  ID 10
references:
- https://learn.microsoft.com/sysinternals/downloads/sysmon
tags:
- attack.t1003.001
- attack.credential-access
logsource:
  product: windows
  service: sysmon
  category: process_access
detection:
  sel:
    EventID: 10
    TargetImage|endswith: \lsass.exe
  filter_allowed:
    SourceImage|contains:
    - \MsMpEng.exe
    - \SenseIR.exe
    - \winlogon.exe
  condition: sel and not filter_allowed
level: high
fields:
- Image
- CommandLine
- ParentImage
- User
- TargetImage
- SourceImage
falsepositives:
- AV/EDR self-protection
