title: NewCredentials Logon (LT=9) via seclogo (PtH)
id: 37370eb0-f878-4495-9772-be20d61c9cbe
status: stable
description: Detects successful logon with LogonType=9 (NewCredentials) and LogonProcessName
  seclogo
tags:
- attack.t1550
- attack.lateral-movement
logsource:
  product: windows
  service: security
detection:
  sel:
    EventID: 4624
    LogonType: 9
  seclogo:
    LogonProcessName: seclogo
  condition: sel and seclogo
level: high
fields:
- IpAddress
- SubjectUserName
- LogonProcessName
- AuthenticationPackageName
falsepositives:
- runas /netonly
